{
  "npcs": [
	{
	  "id": "king",
	  "name": "Король",
	  "dialogues": [
		{
		  "id": "king_start",
		  "lines": [
			"Наконец-то ты здесь. Я вызвал тебя из другого мира не просто так, герой.",
			"Ты обязан спасти это королевство. Я не потерплю отказа.",
			"Ты сам должен победить Короля Демонов — без всяких побрякушек.",
			"Я хочу видеть, на что ты действительно способен."
		  ],
		  "condition": "king_first_meeting",
		  "play_once": true
		},
		{
		  "id": "king_after_guild",
		  "lines": [
			"Ты всерьёз вступил в гильдию?.. Почему ты тратишь их и моё время на эти мелочи?",
			"Я призвал тебя не для того, чтобы ты бегал по поручениям. Король Демонов сам себя не победит."
		  ],
		  "condition": "hero_joined_guild",
		  "play_once": true
		},
		{
		  "id": "king_after_mines",
		  "lines": [
			"В шахты? Ты ходил в чёртовы шахты?!",
			"Ты был призван, чтобы избавить мир от Короля Демонов, а не копать камни, как последний шахтёр. У меня... нет слов. Только ярость.",
			"...И всё же, я — король. Я обязан сдерживать себя. Надеюсь, это был последний раз."
		  ],
		  "condition": "hero_visited_mines",
		  "play_once": true
		},
		{
		  "id": "king_easter",
		  "lines": [
			"*Король выглядел задумчивым, его взгляд стал пустым, но надменность не покидала лица. Казалось, он на миг усомнился в себе — и тут же подавил это чувство.*"
		  ],
		  "condition": "all_main_read",
		  "play_once": true,
		  "type": "easter_egg"
		}
	  ]
	},
	{
	  "id": "guildmaster",
	  "name": "Гильдмастер",
	  "dialogues": [
		{
		  "id": "guildmaster_start",
		  "lines": [
			"Хочешь вступить в гильдию? Покажи, на что ты способен.",
			"Вот тебе первое задание — принеси 3 медных руды."
		  ],
		  "condition": "guildmaster_first_meeting",
		  "play_once": true
		},
		{
		  "id": "guildmaster_after_quest",
		  "lines": [
			"Отлично. Теперь ты полноправный член нашей гильдии... и по совместительству — шахтёр!",
			"Да-да, знаю, не геройская работа. Но выходить за пределы королевства сейчас — самоубийство.",
			"Даже тебе там не продержаться и минуты. Мы готовим снаряжение для большой войны, и руда нужна как никогда.",
			"Поверь, в шахте ты сейчас нужнее, чем на поле боя. А если повезёт — может, и кошку кому-нибудь поймаешь.",
			"У нас есть и более серьёзные поручения. Возвращайся позже."
		  ],
		  "condition": "guild_quest_completed",
		  "play_once": true
		},
		{
		  "id": "guildmaster_easter",
		  "lines": [
			"Когда-то я сам был искателем приключений... пока не получил стрелу в пятку."
		  ],
		  "condition": "all_main_read",
		  "play_once": true,
		  "type": "easter_egg"
		}
	  ]
	},
	{
	  "id": "trader",
	  "name": "Торговец",
	  "dialogues": [
		{
		  "id": "trader_start",
		  "lines": [
			"Приветствую! У меня только лучший товар — хотя тебе это вряд ли по карману.",
			"Вот, например, руна \"Пепельного Рывка\" — вплавленная в неё магия позволяет ускользать от ударов, как дым в воздухе. Мечтаешь об этом? Забудь.",
			"Если соберёшь редкие ингредиенты — могу сделать для тебя особое зелье. Хотя ты, похоже, больше по воде из луж."
		  ],
		  "condition": "trader_first_meeting",
		  "play_once": true
		},
		{
		  "id": "trader_after_first_rune",
		  "lines": [
			"Что?.. Ты и правда смог позволить себе это?.. Хех. Наверное, это случайность.",
			"Не обольщайся, герой, золото в гильдии тебе, видимо, случайно на голову упало."
		  ],
		  "condition": "hero_bought_first_rune",
		  "play_once": true
		},
		{
		  "id": "trader_after_second_rune",
		  "lines": [
			"Так-так... Второй раз? Кто бы мог подумать.",
			"Может, ты и правда не совсем пустышка. Или ты просто грабишь старух по дороге сюда?",
			"Ладно. Уговорил. Покажем тебе что-то поинтереснее."
		  ],
		  "condition": "hero_bought_second_rune",
		  "play_once": true
		},
		{
		  "id": "trader_easter",
		  "lines": [
			"Иногда я думаю открыть лавку в другом измерении. Там спрос побольше."
		  ],
		  "condition": "all_main_read",
		  "play_once": true,
		  "type": "easter_egg"
		}
	  ]
	},
	{
	  "id": "royal_guard_1",
	  "name": "Стражник 1",
	  "dialogues": [
		{
		  "id": "guard1_start",
		  "lines": [
			"Будь осторожен в словах. Его Величество не терпит дерзости.",
			"*Он смотрит на героя с сомнением, словно не верит в сам факт его призвания.*"
		  ],
		  "condition": "guard1_first_meeting",
		  "play_once": true
		},
		{
		  "id": "guard1_after_mines",
		  "lines": [
			"Ты… в шахтах был?.. С ума сошёл. Надеюсь, ты не сказал об этом королю.",
			"Если бы он не был в тронном зале... я бы сбежал сам от этого взгляда."
		  ],
		  "condition": "hero_visited_mines",
		  "play_once": true
		},
		{
		  "id": "guard1_easter",
		  "lines": [
			"Между нами... я терпеть не могу броню. Жутко неудобная. Но зато в ней не видно, как я дрожу, когда король в ярости."
		  ],
		  "condition": "all_main_read",
		  "play_once": true,
		  "type": "easter_egg"
		}
	  ]
	},
	{
	  "id": "royal_guard_2",
	  "name": "Стражник 2",
	  "dialogues": [
		{
		  "id": "guard2_start",
		  "lines": [
			"Смотри, не подведи. Он верит, что ты спасёшь мир. Мы — нет.",
			"Но если вдруг выйдет — не забудь, кто стоял тут, пока ты получал славу."
		  ],
		  "condition": "guard2_first_meeting",
		  "play_once": true
		},
		{
		  "id": "guard2_after_runes",
		  "lines": [
			"Слышал, ты начал скупать руны? Либо ты храбрец, либо дурак.",
			"Хотя, может, в тебе что-то и есть. Не часто тут появляются такие, кто не боится идти против ожиданий."
		  ],
		  "condition": "hero_bought_two_runes",
		  "play_once": true
		},
		{
		  "id": "guard2_easter",
		  "lines": [
			"Если что — я первым сбегу. Просто чтобы предупредить."
		  ],
		  "condition": "all_main_read",
		  "play_once": true,
		  "type": "easter_egg"
		}
	  ]
	}
  ]
}
